#include <locale.h>> 
#include <stdio.h>	
int main()

{
	setlocale(LC_CTYPE, "RUS");
	printf("123\n"); // 1.1
	printf("1\n2\n3\n"); // 1.2
	printf("1\n 2\n  3\n"); //1.3
	printf("%d\n %d\n  %d\n   %d\n", 1,  2, 3, 4); // 1.4
	printf("%10.3f\n ", 12.234657); //1.5
	printf("%10.5f\n ", 12.234657); //1.6
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2); //1.7
	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5); //1.8
	printf("Остаток от умножения %d на %d равен %d\n ", 2000, 4, 2000 * 4); //1.9
	printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000); //1.10
	printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000); //1.10(d)
	printf("%f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000); //1.10(f)
	printf("%g разделить %g равно %g\n ", 5., 2000000., 5. / 2000000); //1.10(g)
	printf("%e разделить %e равно %e\n ", 5., 2000000., 5. / 2000000); //1.10(e)
}